Repository: quarkusio/pt.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: pt_br

source: For Strimzi, you can select any image with a Kafka version which has Kraft support (2.8.1 and higher) from https://quay.io/repository/strimzi-test-container/test-container?tab=tags
pt_br: Para o Strimzi, você pode selecionar qualquer imagem com uma versão Kafka que tenha suporte para o Kraft (2.8.1 e superior) em https://quay.io/repository/strimzi-test-container/test-container?tab=tags

source: For Windows users:
pt_br: Para usuários do Windows:

source: For a full list of possible statuses, check our https://quarkus.io/faq/#what-are-the-extension-statuses[FAQ entry].
pt_br: Para obter uma lista completa de possíveis status, consulte nosso https://quarkus.io/faq/#what-are-the-extension-statuses[FAQ].

source: For a more detailed guide about debugging native images please refer to the xref:native-reference.adoc[Native Reference Guide].
pt_br: Para obter um guia mais detalhado sobre o debug de imagens nativas, consulte o link:native-reference.html[Guia de Referência Nativo].

source: For a more detailed walk-through that shows you how to configure Basic authentication together with Jakarta Persistence for storing user credentials in a database, see the xref:security-basic-authentication-tutorial.adoc[Secure a Quarkus application with Basic authentication and Jakarta Persistence] guide.
pt_br: Para obter um guia mais detalhado que mostra como configurar a autenticação básica juntamente com o Jakarta Persistence para armazenar credenciais de usuário numa base de dados, consulte o guia link:security-basic-authentication-tutorial.html[Proteger uma aplicação Quarkus com autenticação básica e o Jakarta Persistence].

source: For each call you are intending to do, add a method and use annotations to describe the behavior. You can combine the REST Client with the <a href="https://quarkus.io/guides/smallrye-fault-tolerance">fault tolerance extension</a> to handle failure gracefully. Then, in your resource, just use the <code>ElementService</code> interface:
pt_br: Para cada chamada que você pretende fazer, adicione um método e use anotações para descrever o comportamento. Você pode combinar o cliente REST com a <a href="https://quarkus.io/guides/smallrye-fault-tolerance">extensão de tolerância a falhas</a> para lidar com falhas normalmente. Depois, no seu recurso, basta utilizar a <code>ElementService</code> interface:

source: For example by default reflection in GraalVM will not work, unless a class/member has been explicitly registered for reflection. This is normally achieved by listing every class, method, field and constructor in a JSON file, and passing this as a parameter into the native image build. This obviously gets quite cumbersome for all but the most trivial projects. Quarkus provides a framework that makes it easy to work around these annotations, and programmatically determine what should be registered.
pt_br: Por exemplo, por padrão, o uso de reflexão de classes no GraalVM não funcionará, a menos que uma classe/membro tenha sido explicitamente registrada para reflexão. Isso normalmente é obtido listando cada classe, método, campo e construtor em um arquivo JSON, e passando isso como um parâmetro para a compilação de imagem nativa. Isso obviamente fica bastante complicado para todos, exceto para os projetos mais triviais. O Quarkus fornece uma estrutura que facilita a solução dessas anotações e determina programaticamente o que deve ser registrado.

source: For information about other methods that you can use to configure the required user credentials, see the xref:security-testing.adoc#configuring-user-information[Configuring User Information] section of the Quarkus "Security Testing" guide.
pt_br: Para obter informações sobre outros métodos que você pode utilizar para configurar as credenciais de usuário necessárias, consulte a seção link:security-testing.html#configuring-user-information[Configurar as informações do usuario] do guia "Teste de segurança" do Quarkus.

source: For more information about Basic authentication, its mechanisms, and related identity providers, see the following resources:
pt_br: Para obter mais informações sobre a autenticação básica, os seus mecanismos e os identity providers relacionados, consulte os seguintes recursos:

source: For more information about how to install and use the Quarkus CLI, see the xref:cli-tooling.adoc[Quarkus CLI] guide.
pt_br: Para obter mais informações sobre como instalar e usar a CLI do Quarkus, consulte o guia xref:cli-tooling.adoc[Quarkus CLI].

source: For more information, see link:https://issues.redhat.com/browse/CEQ-4878[CEQ-4878].
pt_br: Para obter mais informações, consulte o link:https://issues.redhat.com/browse/CEQ-4878[CEQ-4878].

source: For podman:
pt_br: Para o podman:

source: For questions related to the development of Quarkus:
pt_br: Para questões relacionadas ao desenvolvimento do Quarkus:

source: For the last 25 years, Java has performed for organizations across the world but you've never seen anything like this. We'll cover all the classics like "Start Me Up" and "Living' on a VM" and some new jams like "Stairway to Native" and "Sweet JPA of Mine" and more.
pt_br: Nos últimos 25 anos, o Java tem atuado para organizações em todo o mundo, mas você nunca viu nada assim. Vamos cobrir todos os clássicos como "Start Me Up" e "Living' on a VM" e algumas novas jams como "Stairway to Native" e "Sweet JPA of Mine" e muito mais.

source: For this type of application, Quarkus relies on well-known standards such as JAX-RS, JPA and MicroProfile Rest Client, but also Hibernate with Panache to simplify interactions with databases.
pt_br: Para esse tipo de aplicação, o Quarkus conta com padrões bem conhecidos, como JAX-RS, JPA e MicroProfile Rest Client, mas também Hibernate com Panache para simplificar as interações com bancos de dados.

source: For usage questions, we recommend to:
pt_br: Para perguntas de uso, recomendamos:

source: For years, the client-server architecture has been the de-facto standard to build applications. But a significant shift happened. The <em>one model rules them all</em> age is over. A new range of applications and architectural styles have emerged and transformed how code is written and how applications are deployed and executed. HTTP microservices, reactive applications, event-driven architecture, and serverless are now central players in modern systems.
pt_br: Por anos, a arquitetura cliente-servidor tem sido o padrão de fato para criar aplicativos. Mas uma mudança significativa aconteceu. A era do <em>único modelo que rege todos eles</em> acabou. Uma nova gama de aplicativos e estilos de arquitetura surgiram e transformaram a forma como o código é escrito e como as aplicações são implantadas e executadas. Microsserviços HTTP, aplicações reativas, arquitetura orientada a eventos e sem servidor agora são atores centrais em sistemas modernos.

source: From ARM/64 to AMD/64
pt_br: De ARM/64 para AMD/64

source: From the outset, Quarkus has been designed around a container-first philosophy. What this means in concrete terms is that Quarkus applications are optimised for low memory usage and fast startup times in the following ways:
pt_br: Desde o início, o Quarkus foi projetado em torno de uma filosofia de contêiner em primeiro lugar. O que isso significa em termos concretos é que as aplicações Quarkus são otimizadas para baixo uso de memória e tempos de inicialização rápidos das seguintes maneiras:

source: Fully static native executables support is experimental.
pt_br: O suporte a executáveis nativos totalmente estáticos é experimental.

source: Funqy HTTP Binding with Google Cloud Functions
pt_br: Integração HTTP do Funqy com o Google Cloud Functions

source: Generate X.509 certificates with Vault’s PKI Secret Engine.
pt_br: Gere certificados X.509 com o PKI Secret Engine do Vault.

source: Get answers to some of your common Quarkus questions.
pt_br: Obtenha respostas para algumas de suas perguntas comuns sobre o Quarkus.

source: Get early test feedback with Continuous Testing.
pt_br: Obtenha feedback antecipado sobre os testes com o Teste Contínuo.

source: Get instant feedback on code changes as tests run in the background on impacted code.
pt_br: Obtenha feedback instantâneo sobre alterações de código à medida que os testes são executados em segundo plano no código afetado.

source: Get it running
pt_br: Executando a aplicação

source: Get started with virtual threads with RESTEasy Reactive
pt_br: Comece a usar threads virtuais com o RESTEasy Reactive

source: Getting Help from the Community
pt_br: Obter ajuda da comunidade

source: Getting Started
pt_br: Primeiros passos

source: Getting Started to SmallRye Reactive Messaging with Apache Kafka
pt_br: Introdução ao SmallRye Reactive Messaging com o Apache Kafka

source: Getting Started with Reactive
pt_br: Introdução ao Reativo

source: Getting Started with gRPC
pt_br: Introdução ao gRPC

source: Go more in depth into the Quarkus implementation of CDI.
pt_br: Aprofunde-se na implementação do CDI no Quarkus.

source: Go to the project directory and update the project to the latest stream:
pt_br: Vá para o diretório do projeto e atualize o projeto para a última versão disponível:

source: Going further
pt_br: Indo mais longe

source: Gone are the days of a thousand configuration files and formats. A single configuration file is all it takes for Quarkus applications to configure every single extension.
pt_br: Foi-se o tempo de mil arquivos de configuração e formatos. Basta um único arquivo de configuração para que os aplicativos do Quarkus configurem cada extensão.

source: Google Cloud Functions with Vert.x Web, Servlet, or RESTEasy
pt_br: Google Cloud Functions com Vert.x Web, Servlet ou RESTEasy

source: GraalVM CE 21.3 Mandrel 21.3
pt_br: GraalVM CE 21.3 Mandril 21.3

source: GraalVM Native Executable support has been an essential part of the design for Quarkus from the beginning. When an application is compiled down to a native executable, it starts much faster and can run with a much smaller heap than a standard JVM. The native compiler uses aggressive dead-code elimination techniques to only embed the parts of the JVM and classes that are absolutely required by your application. Quarkus makes building optimized native executables plain easy. The build-time approach allows Quarkus to collect enough metadata on your application to fine-tune the compilation. No <code>-H:+ReportUnsupportedElementsAtRuntime</code> flag, no fallback, no compromise!
pt_br: O suporte ao GraalVM Native Executable tem sido uma parte essencial do design do Quarkus desde o início. Quando um aplicativo é compilado em um executável nativo, ele é iniciado muito mais rápido e pode ser executado com um heap muito menor do que uma JVM padrão. O compilador nativo usa técnicas agressivas de eliminação de código morto para incorporar apenas as partes da JVM e as classes que são absolutamente exigidas pelo seu aplicativo. O Quarkus facilita a criação de executáveis nativos otimizados. A abordagem de tempo de compilação permite que o Quarkus colete metadados suficientes em seu aplicativo para ajustar a compilação. Acabou-se a necessidade de adicionar a flag <code>-H:+ReportUnsupportedElementsAtRuntime</code> e outras gambiarras!

source: GraalVM binaries are not (yet) notarized for macOS as reported in this https://github.com/oracle/graal/issues/1724[GraalVM issue]. This means that you may see the following error when using `native-image`:
pt_br: Os binários do GraalVM não estão (ainda) certificados para macOS, conforme relatado nesta link:https://github.com/oracle/graal/issues/1724[issue do GraalVM]. Isso significa que pode ocorrer o seguinte erro ao usar `native-image`:

source: GraalVM for JDK 17/20 Mandrel 23.0
pt_br: GraalVM para JDK 17/20 Mandrel 23.0

source: GraalVM for JDK 17/20 Mandrel 23.0 (17.0.7)
pt_br: GraalVM para JDK 17/20 Mandrel 23.0 (17.0.7)

source: Granularity of the ack-timeout redelivery. + Using an higher `tickDurationMillis` reduces the memory overhead to track messages when setting ack-timeout to a bigger value (for example, 1 hour).
pt_br: Granularidade da reentrega do tempo limite de ack. + Usar um 'tickDurationMillis' mais alto reduz a sobrecarga de memória para rastrear mensagens ao definir o tempo limite de ack-para um valor maior (por exemplo, 1 hora).

source: Group a consumer acknowledgment for a specified time. + By default, a consumer uses 100ms grouping time to send out acknowledgments to a broker. + Setting a group time of 0 sends out acknowledgments immediately. + A longer ack group time is more efficient at the expense of a slight increase in message re-deliveries after a failure.
pt_br: Agrupe uma confirmação de consumidor por um tempo especificado. + Por padrão, um consumidor usa o tempo de agrupamento de 100ms para enviar confirmações a um corretor. + Definir um tempo de grupo de 0 envia confirmações imediatamente. + Um tempo de grupo mais longo é mais eficiente às custas de um ligeiro aumento nas reentregas de mensagens após uma falha.

source: Group a consumer acknowledgment for the number of messages.
pt_br: Agrupe uma confirmação de consumidor para o número de mensagens.

source: Group multiple configuration properties into an object.
pt_br: Agrupa várias propriedades de configuração num objeto.

source: Guides
pt_br: Guias

source: Guides - Latest
pt_br: Guias - Mais recentes

source: HTTP Reference Documentation
pt_br: Documentação de referência HTTP

source: Hardcoded values in your code is a no go (even if we all did it at some point ;-)). In this guide, we learn how to configure your application.
pt_br: Os valores codificados no seu código não são permitidos (mesmo que todos nós o tenhamos feito em algum momento ;-)). Neste guia, vamos aprender a configurar a sua aplicação.

source: Hashing function determining the partition where you publish a particular message (partitioned topics only). + Available options are as follows: + * `pulsar.JavastringHash`: the equivalent of `string.hashCode()` in Java + * `pulsar.Murmur3_32Hash`: applies the https://en.wikipedia.org/wiki/MurmurHash[Murmur3] hashing function + * `pulsar.BoostHash`: applies the hashing function from C++'s https://www.boost.org/doc/libs/1_62_0/doc/html/hash.html[Boost] library
pt_br: Função de hash que determina a partição onde você publica uma mensagem específica (somente tópicos particionados). + As opções disponíveis são as seguintes: + * 'pulsar. JavastringHash': o equivalente a 'string.hashCode()' em Java + * 'pulsar. Murmur3_32Hash': aplica a função de hash https://en.wikipedia.org/wiki/MurmurHash[Murmur3] + * 'pulsar. BoostHash': aplica a função de hash da biblioteca https://www.boost.org/doc/libs/1_62_0/doc/html/hash.html[Boost] do C++

source: Have a more in-depth look at how SmallRye Stork can be configured and used.
pt_br: Veja mais detalhadamente como o SmallRye Stork pode ser configurado e usado.

source: Here's how its mapped:
pt_br: Eis o seu mapa:

source: Here's the same example, but with the AWS Gateway REST API:
pt_br: Aqui está o mesmo exemplo, mas com a API REST do AWS Gateway:

source: Hibernate ORM REST Data with Panache simplifies the creation of CRUD applications based on JAX-RS and Hibernate ORM.
pt_br: Hibernate ORM REST Data with Panache simplifica a criação de aplicativos CRUD baseados em JAX-RS e Hibernate ORM.

source: Hibernate ORM is the de facto JPA implementation and offers you the full breadth of an Object Relational Mapper. It makes complex mappings possible, but it does not make simple and common mappings trivial. Panache focuses on making your entities trivial and fun to write.
pt_br: O Hibernate ORM é a implementação JPA de fato e oferece toda a amplitude de um Mapeador Relacional de Objetos. Ele possibilita mapeamentos complexos, mas não torna triviais mapeamentos simples e comuns. Panache se concentra em tornar suas entidades triviais e divertidas de escrever.

source: Hibernate ORM is the de facto JPA implementation and offers you the full breath of an Object Relational Mapper. It works beautifully in Quarkus.
pt_br: O Hibernate ORM é a implementação JPA de facto e oferece a você o fôlego completo de um Mapeador Relacional de Objetos. Ele funciona muito bem no Quarkus.

source: Hibernate Search allows you to index your entities in an Elasticsearch cluster and easily offer full text search in all your Hibernate ORM-based applications.
pt_br: O Hibernate Search permite indexar suas entidades em um cluster do Elasticsearch e oferecer facilmente pesquisa de texto completo em todos os aplicativos baseados no Hibernate ORM.

source: High concurrency and low resource usage
pt_br: Alta concorrência e baixo uso de recursos

source: How capabilities are implemented and used in Quarkus.
pt_br: Como as capacidades são implementadas e utilizadas no Quarkus.

source: How dev mode differs from a production application
pt_br: Como é que o modo de desenvolvimento difere de uma aplicação de produção

source: However, HTTP characteristics prohibit implementing <a href="https://www.reactivemanifesto.org/">reactive systems</a>, where all the components interact using asynchronous messages passing.
pt_br: No entanto, as características HTTP proíbem a implementação de <a href="https://www.reactivemanifesto.org/">sistemas reativos</a>, onde todos os componentes interagem usando a passagem assíncrona de mensagens.

source: However, thread locals are not propagated.
pt_br: No entanto, as thread locals não são propagadas.

source: I don't need transaction when I do read only operations, it's faster.
pt_br: Não preciso de transação quando faço operações somente leitura, é mais rápido.

source: Identifier of a CDI bean that provides the default Kafka consumer/producer configuration for this channel. The channel configuration can still override any attribute. The bean must have a type of Map<String, Object> and must use the @io.smallrye.common.annotation.Identifier qualifier to set the identifier. Type: _string_
pt_br: Identificador de um bean CDI que fornece a configuração padrão do consumidor/produtor Kafka para esse canal. A configuração do canal ainda pode substituir qualquer atributo. O bean deve ter um tipo de Map<String, Object> e deve usar o qualificador @io.smallrye.common.annotation.Identifier para definir o identificador. Tipo: _string_

source: Identifier of a CDI bean that provides the default Pulsar client configuration for this channel. The channel configuration can still override any attribute. The bean must have a type of Map<String, Object> and must use the @io.smallrye.common.annotation.Identifier qualifier to set the identifier.
pt_br: Identificador de um bean CDI que fornece a configuração padrão do cliente Pulsar para esse canal. A configuração do canal ainda pode substituir qualquer atributo. O bean deve ter um tipo de Map<String, Object> e deve usar o qualificador @io.smallrye.common.annotation.Identifier para definir o identificador.

source: Identifier of a CDI bean that provides the default Pulsar consumer configuration for this channel. The channel configuration can still override any attribute. The bean must have a type of Map<String, Object> and must use the @io.smallrye.common.annotation.Identifier qualifier to set the identifier.
pt_br: Identificador de um bean CDI que fornece a configuração padrão do consumidor Pulsar para esse canal. A configuração do canal ainda pode substituir qualquer atributo. O bean deve ter um tipo de Map<String, Object> e deve usar o qualificador @io.smallrye.common.annotation.Identifier para definir o identificador.

source: Identifier of a CDI bean that provides the default Pulsar producer configuration for this channel. The channel configuration can still override any attribute. The bean must have a type of Map<String, Object> and must use the @io.smallrye.common.annotation.Identifier qualifier to set the identifier.
pt_br: Identificador de um bean CDI que fornece a configuração padrão do produtor Pulsar para esse canal. A configuração do canal ainda pode substituir qualquer atributo. O bean deve ter um tipo de Map<String, Object> e deve usar o qualificador @io.smallrye.common.annotation.Identifier para definir o identificador.

source: If `api-version` is not set, the latest version for the given flavor will be used. Otherwise, the version must match a https://github.com/dajudge/kindcontainer/blob/master/k8s-versions.json[version supported by the given flavor].
pt_br: Se a api-version não estiver definida, a versão mais recente para a variante fornecido será usada. Caso contrário, a versão deve corresponder a uma https://github.com/dajudge/kindcontainer/blob/master/k8s-versions.json[versão suportada pela variante fornecida].

source: If `replicateSubscriptionState` is enabled, a subscription state is replicated to geo-replicated clusters.
pt_br: Se 'replicateSubscriptionState' estiver habilitado, um estado de assinatura será replicado para clusters replicados geograficamente.

source: If enabling `readCompacted`, a consumer reads messages from a compacted topic rather than reading a full message backlog of a topic. A consumer only sees the latest value for each key in the compacted topic, up until reaching the point in the topic message when compacting backlog. Beyond that point, send messages as normal. Only enabling `readCompacted` on subscriptions to persistent topics, which have a single active consumer (like failure or exclusive subscriptions). Attempting to enable it on subscriptions to non-persistent topics or on shared subscriptions leads to a subscription call throwing a `PulsarClientException`.
pt_br: Se habilitar 'readCompacted', um consumidor lerá mensagens de um tópico compactado em vez de ler uma lista de pendências de mensagens completa de um tópico. Um consumidor só vê o valor mais recente para cada chave no tópico compactado, até chegar ao ponto na mensagem de tópico ao compactar a lista de pendências. Além desse ponto, envie mensagens normalmente. Habilitar apenas 'readCompacted' em assinaturas de tópicos persistentes, que tenham um único consumidor ativo (como falha ou assinaturas exclusivas). A tentativa de habilitá-lo em assinaturas de tópicos não persistentes ou em assinaturas compartilhadas leva a uma chamada de assinatura lançando um 'PulsarClientException'.

source: If it is set to `true`, when the outgoing message queue is full, the `Send` and `SendAsync` methods of producer block, rather than failing and throwing errors. + If it is set to `false`, when the outgoing message queue is full, the `Send` and `SendAsync` methods of producer fail and `ProducerQueueIsFullError` exceptions occur. The `MaxPendingMessages` parameter determines the size of the outgoing message queue.
pt_br: Se estiver definido como 'true', quando a fila de mensagens de saída estiver cheia, os métodos 'Send' e 'SendAsync' do produtor bloqueiam, em vez de falhar e lançar erros. + Se ele estiver definido como 'false', quando a fila de mensagens de saída estiver cheia, os métodos 'Send' e 'SendAsync' do produtor falham e as exceções 'ProducerQueueIsFullError' ocorrem. O parâmetro 'MaxPendingMessages' determina o tamanho da fila de mensagens de saída.

source: If one of those extensions is present, then creating a container image for the native executable is essentially a matter of executing a single command:
pt_br: Se uma dessas extensões estiverem presente, então a criação de uma imagem de contêiner para o executável nativo é executar um único comando:

source: If running `gdb` from a different directory than `target`, then the sources can be loaded by running:
pt_br: Se executar `gdb` a partir de um diretório diferente do `target`, então as fontes podem ser carregadas ao executar:
